<details><summary>Show Plan</summary>
```

terraform
data.aws_ecr_repository.gotrue_proxy: Reading...
data.aws_ecr_repository.gotrue: Reading...
module.secrets.aws_secretsmanager_secret.smtp_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-smtp-password-60z8a2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-021a060f245418f54]
module.secrets.aws_secretsmanager_secret.captcha_session_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-captcha-session-key-GRaZjE]
module.secrets.aws_secretsmanager_secret.catcha_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-captcha-secret-NTfLx1]
module.secrets.aws_secretsmanager_secret.smtp_username: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-smtp-username-7ZMHA3]
module.login_domain.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/6c659e5d-f0d0-4faf-9ae4-ea17bb73d2d1]
module.env_bucket.aws_s3_bucket.bucket: Refreshing state... [id=staging.cloud-siwe.private.staging.walletconnect]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d542c94e0983bf0a]
module.secrets.aws_secretsmanager_secret.database_url: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-database-url-NTfLx1]
data.aws_ecr_repository.gotrue: Read complete after 1s [id=gotrue]
module.secrets.aws_secretsmanager_secret.jwt_secret: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:cloud-siwe-staging-jwt-secret-60z8a2]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=cloud-siwe-staging_logs]
data.aws_ecr_repository.gotrue_proxy: Read complete after 1s [id=gotrue_proxy]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.login_domain.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/cloud-siwe-staging]
module.login_domain.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z0277745YCN4RCIGXVXG]
module.login_domain.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z0277745YCN4RCIGXVXG__ba855f0cb53b748351d5c7879a1a04f5.staging.login.walletconnect.com._CNAME]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/cloud-siwe-staging-target-group/a1811ede31773a59]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e60b9bf4d9b3daaa]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0681536707cca2529]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a29ed5243d8ddab9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0349d9e5f14db99af]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-06fb3aa6cca7a0914]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f76e0852b0ede05f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a88866e1e41ad921]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-046744b47cf6c4434]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e9ac5fe44e8dc5ee]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f576b0c6b2a5352a]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0a0e27201443bfd81]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e60b9bf4d9b3daaa1080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03d98d05d3dff6729]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04279dbe8023b918f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a906f03bacf70545]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06c2591f86add7bed]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f0d3239946451ccb]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0cfc3d228bff9f335]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00c9956ae6d59c4e4]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/cloud-siwe-staging-load-balancer/d4dfec68fe12ced0]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a29ed5243d8ddab91080289494]
module.env_bucket.aws_s3_bucket_acl.acl: Refreshing state... [id=staging.cloud-siwe.private.staging.walletconnect,private]
module.env_bucket.aws_s3_bucket_versioning.versioning: Refreshing state... [id=staging.cloud-siwe.private.staging.walletconnect]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=cloud-siwe-staging-ecs-task-execution-role]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z0277745YCN4RCIGXVXG_staging_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/cloud-siwe-staging-load-balancer/d4dfec68fe12ced0/6a9a395636c439a7]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/cloud-siwe-staging-load-balancer/d4dfec68fe12ced0/ace302f71353810d]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=cloud-siwe-staging-ecs-task-execution-role-20220812150019673000000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_cloudwatch_policy: Refreshing state... [id=cloud-siwe-staging-ecs-task-execution-role-20220812150019677300000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=cloud-siwe-staging-ecs-task-execution-role-20220812150019680700000003]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=cloud-siwe-staging-gotrue]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/cloud-siwe-staging/cloud-siwe-staging-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/cloud-siwe-staging/cloud-siwe-staging-service"
        name                               = "cloud-siwe-staging-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/cloud-siwe-staging-gotrue:6" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/cloud-siwe-staging-gotrue:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - mountPoints      = [] -> null
                    name             = "cloud-siwe-staging-gotrue"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (9 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ environment  = [
                        {
                            name  = "CORS_HEADERS"
                            value = "*"
                        },
                      ~ {
                            name  = "CORS_METHODS"
                          ~ value = "GET, POST, PATCH, OPTIONS" -> "GET, POST, PATCH, PUT, OPTIONS"
                        },
                        {
                            name  = "CORS_ORIGINS"
                            value = "*"
                        },
                        # (4 unchanged elements hidden)
                    ]
                  - mountPoints  = [] -> null
                    name         = "nginx-proxy"
                  ~ portMappings = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom  = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "cloud-siwe-staging-gotrue" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```
</details>
*Action: `pull_request`*